In [2]:
import numpy as np
import pandas as pd

In [9]:
d = {'A':[1,2,3] ,'B':[4,np.nan, np.nan] ,'C':[8,np.nan,6] }
d

{'A': [1, 2, 3], 'B': [4, nan, nan], 'C': [8, nan, 6]}

In [10]:
df = pd.DataFrame(d)

In [11]:
df

   A    B    C
0  1  4.0  8.0
1  2  NaN  NaN
2  3  NaN  6.0

In [12]:
df.dropna()

   A    B    C
0  1  4.0  8.0

In [16]:
df.dropna(axis = 1)

   A
0  1
1  2
2  3

In [17]:
df.dropna(axis = 0)

   A    B    C
0  1  4.0  8.0

In [18]:
# atleast two non na values
df.dropna(thresh=2)

   A    B    C
0  1  4.0  8.0
2  3  NaN  6.0

In [19]:
df.dropna(thresh=1)

   A    B    C
0  1  4.0  8.0
1  2  NaN  NaN
2  3  NaN  6.0

In [20]:
df.fillna('filled')

   A       B       C
0  1       4       8
1  2  filled  filled
2  3  filled       6

In [21]:
df['A'].fillna( value = df['A'].mean())

0    1
1    2
2    3
Name: A, dtype: int64